app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO `users` (`name`, `username`, `email`, `phone`, `description`, `created_at`, `updated_at`) VALUES ('Nhut', 'nhutn', 'nhut@gmail.com', '0989979121', 'This is Nhut!', '2021-06-14 12:57:46.626240', '2021-06-14 12:57:46.626240')

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 35 LIMIT 1
UPDATE `users` SET `users`.`description` = 'This is Nhut from TINYPulse!', `users`.`updated_at` = '2021-06-14 15:49:07.949043' WHERE `users`.`id` = 35

  def destroy
    @user = User.find(params[:id])
    if @user
      @user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 53 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 53